/* The string for canceling a map editing function. */
"CancelKey" = "Cancelar";

/* The title text in the alert when cancelling map editing. */
"CancelEditAlertTitleKey" = "Cancelar?";

/* The message text in the alert when cancelling map editing (no points created). */
"CancelEditAlertMessageKey" = "As modificações não serão guardadas.";

/* The message text in the alert when cancelling map editing (points created). */
"CancelEditAlertPointsCreatedMessageKey" = "O objeto que criou não será guardado.";

/* The text of the alert action when discarding editing changes. */
"DiscardChangesTitleKey" = "Rejeitar alterações";

/* The text of the alert action when the users cancels editing an address field */
"CancelEditingTitleKey" = "Cancelar a edição";

/* The title text in the alert when entering an address that is invalid. */
"InvalidAddressTitleKey" = "Endereço inválido";

/* The message in the invalid address alert when an address is required. */
"AddressRequiredMessage" = "Deve ser incluído um endereço para o ponto";

/* The title text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationTitleKey" = "Não adicionou uma localização para este ponto";

/* The message text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationMessageKey" = "Não será adicionado um novo ponto";

/* The text of the alert action to continuing editing. */
"ContinueEditingTitleKey" = "Continuar a edição";

/* The title text in the alert when tapping an invalid point when trying to delete. */
"DeletePointErrorTitleKey" = "Selecione o ponto que pretende eliminar.";

/* The title text in the alert when trying to delete an editing point on the map, but no editing points exist. */
"EmptyDeletePointErrorTitleKey" = "Não há pontos a eliminar.";

/* The text of the alert action to dismiss the alert. */
"OKTitleKey" = "OK";

/* The title text of the alert when deleting all stored editing points. */
"ClearAllPointsTitleKey" = "Tem a certeza de que pretende limpar todos os pontos?";

/* The text of the alert action to reject the alert prompt. */
"NoTitleKey" = "Não";

/* The text of the alert action to accept the alert prompt */
"YesTitleKey" = "Sim";

/* The title text of the alert when switching editing geometries to a point. */
"ChangeGeometryPointTitleKey" = "Pretende mudar para um ponto?";

/* The title text of the alert when switching editing geometries to a polyline. */
"ChangeGeometryPolylineTitleKey" = "Pretende mudar para uma polilinha?";

/* The title text of the alert when switching editing geometries to a polygon. */
"ChangeGeometryPolygonTitleKey" = "Pretende mudar para um polígono?";

/* The message text in the alert when switching to a multipoint geometry. */
"ChangeGeometryToMultiPointMessageKey" = "Os pontos que adicionou não serão alterados e pode continuar a criar o objeto";

/* The message text in the alert when switching to a point geometry. */
"ChangeGeometryToPointMessageKey" = "Todos os pontos adicionados serão eliminados";

/* The title text of the alert when deleting a point of the editing geometry. */
"DeletePointTitleKey" = "Tem a certeza de que pretende eliminar este ponto?";

/* The title of the button to save the editing geometry. */
"SaveButtonTitleKey" = "Guardar";

/* The title of the button to filter the geometry. */
"FilterTitleKey" = "Filtro";

/* The status text of the User Location TableViewCell in the suggesiton panel. */
"CurrentLocationKey" = "Localização atual";

/* The footnote text of the TableViewCell in the suggesiton panel if no suggestions are returned. */
"NoSuggestionsFoundKey" = "Nenhuma sugestão encontrada";

/* The text of the editingPanel Address textField. */
"AddressKey" = "Endereço";

/* The title of the button to delete all stored editing points. */
"ClearAllKey" = "Limpar tudo";

/* The text of the Toast Message after creating an object. */
"CreatedObjectToastMessage" = "%@ criado com êxito";

/* The placeholder text of the Searchbar */
"SearchKey" = "Procurar";

/* The placeholder text to add a new geospatial point by tapping on the map or typing an address. */
"AddNewPointKey" = "Adicionar novo ponto";

/* The title of the cell to pick from available map types. */
"BasemapKey" = "Mapa base";

/* The title for the standard map type. */
"StandardKey" = "Padrão";

/* The title for the hybrid map type. */
"HybridKey" = "Híbrido";

/* The title for the hybrid flyover map type. */
"HybridFlyoverKey" = "Viaduto híbrido";

/* The title for the muted standard map type. */
"MutedStandardKey" = "Padrão com som desativado";

/* The title for the satellite map type. */
"SatelliteKey" = "Satélite";

/* The title for the satellite flyover map type. */
"SatelliteFlyoverKey" = "Viaduto de satélite";

/* The text of add location button for location form cell. */
"AddLocationButtonKey" = "Adicionar localização";

